Repository: shadil-rayyan/maths-tutor
Catalog: po/*.po
Languages: ar, hi, ml, ta

source: Welcome!
ar: مرحبا
hi: स्वागत!
ml: സ്വാഗതം!
ta: வணக்கம்!

source: Press enter to start
ar: اضغط على enter للبدء
hi: प्रारंभ करने के लिए एंटर दबाएँ
ml: ആരംഭിക്കാൻ എന്റർ അമർത്തുക
ta: தொடங்குவதற்கு என்டர் ஐ அழுத்தவும்

source: Excellent-1
ar: عظيم
hi: उत्कृष्ट
ml: അപാരം
ta: சிறந்த பாராட்டுக்கள்

source: Excellent-2
ar: ممتاز
hi: अत्यधिक
ml: അതിഗംഭീരം
ta: உன் திறமை மிகுந்தது

source: Excellent-3
ar: رائع
hi: अद्भुत
ml: അത്ഭുതകരം
ta: திறமையை நான் பாராட்டுகிறேன்

source: Excellent-4
ar: عجيب
hi: बहुत अच्छा
ml: അതിശയകരം
ta: அருமை ! இப்படி முன்னேறிக் கொண்டே இரு

source: Excellent-5
ar: شاطر
hi: बहुत अच्छा
ml: അതികേമം
ta: உங்கள் திறமை் அற்புதம்

source: Very good-1
ar: أحسن
hi: बहुत अच्छा
ml: വളരെ നല്ലത്
ta: சிறப்பு

source: Very good-2
ar: مذهل
hi: बहुत बढ़िया
ml: ഗംഭീരം
ta: அருமை

source: Very good-3
ar: مبروك
hi: अच्छा
ml: കേമം
ta: பலே

source: Very good-4
ar: جيد جداً
hi: बधाई हो
ml: അഭിനന്ദനങ്ങൾ
ta: மகிழ்ச்சி

source: Very good-5
ar: زين، بارك الله
hi: बहुत बढ़िया
ml: വളരെ മികച്ചത്
ta: மிக நல்லது

source: Good-1
ar: جيد
hi: अच्छा
ml: നന്നായി
ta: நல்லது

source: Good-2
ar: زين.
hi: सर्वश्रेष्ट
ml: മികച്ചത്
ta: வாழ்த்துக்கள்

source: Good-3
ar: حسن
hi: अच्छा
ml: നന്നായി
ta: தித்திப்பான

source: Good-4
ar: أفضل
hi: श्रेष्ट
ml: ഉത്തമം
ta: நல்லது

source: Good-5
ar: مناسب
hi: उचित रूप से
ml: ഉചിതമായി
ta: நலம்

source: Fair-1
ar: خير
hi: अच्छा
ml: കൊള്ളാം
ta: நியாயமான

source: Fair-2
ar: موافق
hi: उपयुक्त
ml: അനുയോജ്യം
ta: நன்று

source: Fair-3
ar: ملائم
hi: उपयुक्त
ml: ഉചിതം
ta: சராசரி

source: Fair-4
ar: مقبول
hi: स्वीकार्य
ml: സ്വീകാര്യം
ta: சமத்துவமான

source: Fair-5
ar: واصل
hi: ऐसे ही
ml: അങ്ങനെത്തന്നെ
ta: மிதமான

source: Okay-1
ar: نعم
hi: ठीक है
ml: ഓക്കേ
ta: சரி

source: Okay-2
ar: صحيح
hi: ठीक है
ml: ശരി
ta: ஒத்துக் கொள்ளத்தக்க

source: Okay-3
ar: متفق
hi: मान गया
ml: സമ്മതിച്ചു
ta: நன்றாக

source: Okay-4
ar: صح
hi: यह सही है
ml: ശരി തന്നെ
ta: நன்கு

source: Okay-5
ar: مؤهل
hi: मानक
ml: നിലവാരമുള്ളത്
ta: திருப்தியான

source: plus
ar: زائد
hi: जोड़
ml: അധികം
ta: கூட்டல்

source: minus
ar: ناقص
hi: घटाना
ml: ന്യുനം
ta: கழித்தல்

source: multiply
ar: ضرب
hi: गुणन
ml: ഗുണനം
ta: பெருக்கல்

source: divided by
ar: مقسمة على
hi: विभाजन
ml: ഭാഗം
ta: வகுக்கல்

source: percentage of
ar: نسبة مئوية
hi: प्रतिशद
ta: சதவீதம்

source: Sorry! The correct answer is
ar: آسف ، الاجابة الصحيحة.......
hi: सही उतर
ml: ശരിയായ ഉത്തരം
ta: மண்ணிக்கவும். சரியான விடை

source: point
ar: نقطة
hi: दशमल्व
ml: ദശാംശം
ta: புள்ளி

source: Sorry! Let's try again
ar: اسف، حاول مرة أخرى
hi: क्षमा कीजिए! फिर कोशिश करो
ml: വീണ്ടും ശ്രമിക്കാം!
ta: மன்னிக்கவும்! மீண்டும் முயற்சிப்போம்

source: Successfully finished! Your mark is
ar: أنتهى بنجاح ،علامتك....
hi: जीत हुव। कुल स्कोर
ml: വിജയിച്ചിരിക്കുന്നു! ആകെ ലഭിച്ച സ്കോർ
ta: வெற்றிகரமாக முடிந்தது! உங்கள் மதிப்பெண்

source: Time taken
ar: الوقت المستغرق
hi: कुल ले समय
ml: ആകെ എടുത്ത സമയം
ta: எடுக்கப்பட்ட நேரம்

source: minutes and
ar: الدقائق
hi: मिनट
ml: മിനിറ്റുകളും
ta: நிமிடங்கள் மற்றும்

source: seconds!
ar: والثواني
hi: सेकेंड!
ml: സെക്കണ്ടും!
ta: நொடிகளில்!

source: Enter the number of bells rung!
ar: ادخل عدد رنات الجرس
hi: कितना खंडी बजी !
ml: മണി അടിച്ചതിന്റെ എണ്ണം നൽകുക!
ta: மணிகள் ஒலியின் எண்ணிக்கையை உள்ளிடவும்!

source: equals to?
ar: يساوي ؟
hi: बराबर?
ml: സമമായത് ?
ta: சமம்?

source: Enter
ar: أدخل
hi: लिखो
ml: എഴുതു,
ta: உள்ளிடவும்

source: Maths-Tutor
ar: مدرس الرياضيات
hi: गणित- शिक्षक
ml: ഗണിത-സഹായി
ta: கணித-ஆசிரியர்

source: Select Language
ar: اختر اللغة
hi: भाषा चुने
ml: ഭാഷ തിരഞ്ഞെടുക്കുക
ta: மொழியை தேர்ந்தெடுங்கள்

source: Remember Selection
ar: تذكر اختيارك
hi: चयन याद करो
ml: തിരഞ്ഞെടുത്തത് ഓർക്കുക
ta: தேர்வை நினைவில் கொள்க

source: Addition (+)
ar: زائد
hi: जोड़ (+)
ml: അധികം (+)
ta: கூட்டல் (+)

source: Simple
ar: سهل جداً
hi: सरल
ml: ലളിതം
ta: எளிய

source: Easy
ar: سهل
hi: आसान
ml: എളുപ്പം
ta: எளிதாக

source: Medium
ar: متوسط
hi: माद्यमिक
ml: ഇടത്തരം
ta: நடுத்தரம்

source: Hard
ar: صعب
hi: कठिन
ml: കഠിനം
ta: கடினம்

source: Challenging
ar: صعب جداً
hi: चुनौतीपूर्ण
ml: അതി കഠിനം
ta: மிக கடினம்

source: Subtraction (-)
ar: ناقص
hi: घटाना (-)
ml: ന്യുനം (-)
ta: கழித்தல் (-)

source: Multiplication (*)
ar: ضرب
hi: गुणन(*)
ml: ഗുണനം (*)
ta: பெருக்கல் (*)

source: Division (/)
ar: تقسيم
hi: विभाजन (/)
ml: ഭാഗം (/)
ta: வகுத்தல் (/)

source: Percentage (%)
ar: نسبة مئوية
hi: प्रतिशद (%)
ml: ശതമാനം (%)
ta: சதவிதம் (%)

source: Show Settings
ar: عرض الاعداد
hi: सेटिंग्स दिखाए
ml: ക്രമീകരണങ്ങൾ കാണിക്കുക
ta: அமைப்புகளைக் காட்டு

source: About
ar: عن البرنامج
hi: के बारे में
ml: സംബന്ധിച്ച്
ta: பற்றி

source: Help
ar: المساعدة
hi: मदद
ml: സഹായം
ta: உதவி

source: Quit
ar: اخرج
hi: बाहर जाना
ml: പുറത്ത് കടക്കുക
ta: விலகு

source: Select Operation:
ar: اختر المشغل
hi: क्रिया चुनें:
ml: ക്രിയ തിരഞ്ഞെടുക്കുക:
ta: செயல்பாட்டைத் தேர்ந்தெடுக்கவும்:

source: Select Difficulty Level:
ar: اختر الصعوبة
hi: कठिनाई स्तर चुनें:
ml: കാഠിന്യനിലവാരം:
ta: சவால் நிலை தேர்வு செய்யவும்:

source: Start
ar: ابدأ
hi: शुरू
ml: ആരംഭിക്കുക
ta: தொடங்க

source: Load Questions
ar: تحميل الأسئلة
hi: प्रश्न भरो
ml: ചോദ്യങ്ങൾ ലോഡുചെയ്യുക
ta: கேள்விகளை ஏற்றவும்

source: Speech Synthesizer
ar: مركب الكلام
hi: वर्तमान संकेत
ml: സംസാര സങ്കേതം
ta: பேச்சு சின்தசைசர்

source: Speech Language
ar: لغة التحدث
hi: भाषण भाषा
ml: സംസാര ഭാഷ
ta: பேச்சு மொழி

source: Speech Person
ar: الشخص المتكلم
hi: बोल चाल की व्यक्ति
ml: സംസാരിക്കുന്നയാൾ
ta: பேச்சு நபர்

source: Reset Settings
ar: اعادة ضبط الاعدادات
hi: फिर क्रमबंध करो
ml: ക്രമീകരണങ്ങൾ പുനഃസജ്ജമാക്കുക
ta: அமைப்புகளை மீட்டமைக்கவும்

source: Note: Adjust the speech rate by pressing the apostrophe or semicolon key, which are located to the left of the Enter key. Use the Space key to replay the question, and employ the Shift key to hear the question in verbose mode. Utilize settings to change arithmetic operation, difficulty, load questions, speech language, voice, etc. Press Alt+S to open or hide settings.
ar: اضبط معدل الكلام عن طريق الضغط على مفتاح الفاصلة العليا أو الفاصلة المنقوطة التي تقع على يسار مفتاح الادخال . استخدم مفتاح المسافة (space) للرد على السؤال. استخدم مفتاح التحول(shift)لسماع السؤال في الوضع المطول. استخدم الاعدادات لتغيير العمليات الحسابية. اضغط على مفتاح البديل+س (alt+s) لفتح الاعدادات المختفية.
hi: नोट :एपोस्ट्रोफी या अर्थविराम कुंजी दबाकर भाषण की गाती समायोजित करें, जो एंटर कुंजी के बाई ओर स्थित है। प्रेन को दोबार चलाने केलिए स्पेस कुंजी का उपयोग करें, प्रश्न को वर्णन करने केलिए शिफ्ट कुंजी का उपयोग करें। सेटिंग्स का उपयोग कर के क्रिया, तीव्रता, भाषण शैली, भाषा, आवाज़ अदि को बदल सकते हैं। सेटिंग्स खोलने या छिपाने केलिए alt+S दबायें।
ml: സംസാര വേഗത അനുയോജ്യമാക്കാൻ എന്റർ കീയുടെ ഇടതു വശത്തായുള്ള ആപോസ്ട്രോഫ് അല്ലെങ്കിൽ സെമികോളൻ കീ അമർത്തുക. ചോദ്യം ആവർത്തിക്കുവാൻ സ്പേസ് കീ ഉപയോഗിക്കുക, ചോദ്യം വിവരിച്ചു പറയാൻ ഷിഫ്റ്റ് കീ ഉപയോഗിക്കുക. ക്രമീകരണങ്ങൾ ഉപയോഗിച് ക്രിയ, കഠിനത, സംസാര സങ്കേതം, ഭാഷ, ശബ്ദം, എന്നിവ മാറ്റാം. കൂടാതെ ചോദ്യങ്ങൾ ലോഡ് ചെയ്യാവുന്നതാണ്. ക്രമീകരണങ്ങൾ തുറക്കാൻ അല്ലെങ്കിൽ അടക്കാൻ ആൾട്+എസ് അമർത്തുക.
ta: அப்போஸ்ட்ரோபி அல்லது அரைப்புள்ளி விசையை அழுத்துவதன் மூலம் பேச்சு வீதத்தை சரிசெய்யவும், அவை என்டர் விசையின் இடதுபுறத்தில் அமைந்துள்ளன. மறுபதிப்பு செய்ய ஸபேஸ் விசையைப் பயன்படுத்தவும் கேள்வி, மற்றும் கேள்வியை வாய்மொழி பயன்முறையில் கேட்க ஸ்ப்ட் விசையைப் பயன்படுத்துங்கள். எண்கணித செயல்பாடு, சிரமம், சுமை கேள்விகளை மாற்ற அமைப்புகளைப் பயன்படுத்துங்கள் பேச்சு மொழி, குரல் போன்றவை அமைப்புகளைத் திறக்க அல்லது மறைக்க ALT + S களை அழுத்தவும்.

source: Default
ar: الافتراضي
hi: स्थाई भाव
ml: സ്ഥിരസ്ഥിതി
ta: இயல்புநிலை

source: Please choose a lesson file
ar: الرجاء، اختر ملف الدرس
hi: एक पाठ फ़ाइल चुनें
ml: പാഠഭാഗം തിരഞ്ഞെടുക്കുക
ta: பாடக் கோப்பைத் தேர்ந்தெடுக்கவும்

source: Hide Settings
ar: اخفاء الاعدادات
hi: सेटिंग्स छिपाएँ
ml: ക്രമീകരണങ്ങൾ മറയ്ക്കുക
ta: அமைப்புகளை மறை
