Repository: shadil-rayyan/maths-tutor
Catalog: po/sa.po
Languages: ml

source: Welcome!
ml: स्वागतम्!

source: Press enter to start
ml: आरम्भार्थं प्रवेशकं नुदतु।

source: Excellent-1
ml: उत्कृष्टम्

source: Excellent-2
ml: अत्युत्कृष्टम्

source: Excellent-3
ml: अद्भुतम्

source: Excellent-4
ml: सर्वोत्तमः

source: Excellent-5
ml: असाधारणम्

source: Very good-1
ml: उत्तमम्

source: Very good-2
ml: अद्भुतम्

source: Very good-3
ml: अत्युत्तमः

source: Very good-4
ml: अभिनन्दनानि

source: Very good-5
ml: अत्युत्तमः

source: Good-1
ml: उत्तमा अस्ति

source: Good-2
ml: सर्वोत्तमः

source: Good-3
ml: उत्तमम्

source: Good-4
ml: उत्कृष्टम्

source: Good-5
ml: अद्भुतम्

source: Fair-1
ml: शोभनम्

source: Fair-2
ml: उपयुक्तम्

source: Fair-3
ml: उपयुक्तम्

source: Fair-4
ml: स्वीकार्यम्

source: Fair-5
ml: तथैव

source: Okay-1
ml: सम्यक्

source: Okay-2
ml: एवमेव भवेत्

source: Okay-3
ml: सहमतिः

source: Okay-4
ml: अस्तु

source: Okay-5
ml: गुणवत्ता

source: plus
ml: अधिकम्

source: minus
ml: न्यूनम्

source: multiply
ml: गुणनम्

source: divided by
ml: हरणम्

source: percentage of
ml: प्रतिशतम्

source: Sorry! The correct answer is
ml: क्षम्यतां अस्य समाधानम्

source: point
ml: दशांशम्

source: Sorry! Let's try again
ml: पुनः प्रयतताम्!

source: Successfully finished! Your mark is
ml: विजयः प्राप्तः! आहत्य अङ्कः

source: Time taken
ml: आहत्य स्वीकृतः समयः

source: minutes and
ml: निमेषाणि

source: seconds!
ml: काष्ठिकाः!

source: Enter the number of bells rung!
ml: नादितानां घण्टानां सङ्ख्या ददातु!

source: equals to?
ml: समानम्?

source: Enter
ml: लिखतु

source: Maths-Tutor
ml: गणितसहायकम्

source: Select Language
ml: भाषां चिनोतु

source: Remember Selection
ml: चितं स्मरतु

source: Addition (+)
ml: अधिकम् (+)

source: Simple
ml: ललितम्

source: Easy
ml: सरलम्

source: Medium
ml: मध्यमः

source: Hard
ml: कठिनम्

source: Challenging
ml: अतिकठिनम्

source: Subtraction (-)
ml: व्यवकलनम् (-)

source: Multiplication (*)
ml: गुणनम् (*)

source: Division (/)
ml: हरणम् (/)

source: Percentage (%)
ml: प्रतिशतम् (%)

source: Show Settings
ml: विन्यासान् दर्शय।

source: About
ml: अस्मिन् विषये।

source: Help
ml: साहाय्यं करोतु

source: Quit
ml: बहिर्गच्छ

source: Select Operation:
ml: क्रियां चिनोतु

source: Select Difficulty Level:
ml: काठिन्यस्तरं चिनोतु

source: Start
ml: आरभ

source: Load Questions
ml: प्रश्नान् पूरयतु

source: Speech Synthesizer
ml: संभाषण समन्वयम्

source: Speech Language
ml: संभाषण भाषा

source: Speech Person
ml: वक्ता

source: Reset Settings
ml: पुनरूद्धारः क्रियाः

source: Note: Adjust the speech rate by pressing the apostrophe or semicolon key, which are located to the left of the Enter key. Use the Space key to replay the question, and employ the Shift key to hear the question in verbose mode. Utilize settings to change arithmetic operation, difficulty, load questions, speech language, voice, etc. Press Alt+S to open or hide settings.
ml: सम्प्रेषणस्य गतिं सुकरं कर्तुं एण्टर् की अथवा सेमिकोलन् की इत्यस्य अधिकं विशिष्टं एपोस्ट्रोफी योजयतु।समस्यां निरूपयितुं स्पेस्-की इत्यस्य उपयोगं करोतु, समस्यां निरूपयितुं शिफ्ट्-की इत्यस्य उपयोगं करोतु।कौशलस्य, सामाजिककौशलस्य, भाषा-समस्यायाः च उपयोगेन शिक्षणप्रक्रियायां परिवर्तनं कर्तुं शक्यते। इतोऽपि अधिकप्रश्नाः भारिताः भवेयुः।क्रमीकरणानि उद्घाटयितुं वा समापयितुं वा Alt + S नुदन्तु।

source: Default
ml: पूर्वनिर्धारितम्

source: Please choose a lesson file
ml: विषयस्य चयनं कुरु

source: Hide Settings
ml: क्रमीकरणानि गुप्तं कुरु
